<a href="https://colab.research.google.com/github/aricahyasaputra/data-sains-course-assigment-/blob/main/Week%204/Tugas_4_Data_Sains.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Nama : Ari Cahya Saputra

NIM : 1103190093

Kelas : TK-42-PIL1

Pertama unduh datasetnya dari website Kaggle, disini saya menggunakan Dataset Jumlah Pendapatan daerah pertahun yang saya unduh dari link :  [Indonesia Salary by Region](https://www.kaggle.com/linkgish/indonesian-salary-by-region-19972022)

#Visualisasi Variable

Kita import modul yang diperlukan terlebih dahulu

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/aricahyasaputra/data-sains-course-assigment-/main/Week%204/Indonesian%20Salary%20by%20Region%20(1997-2022).csv")

In [ ]:
df.head(10)

             REGION  SALARY  YEAR
0              ACEH  128000  1997
1    SUMATERA UTARA  151000  1997
2    SUMATERA BARAT  119000  1997
3              RIAU  151500  1997
4             JAMBI  119500  1997
5  SUMATERA SELATAN  127500  1997
6          BENGKULU  127500  1997
7           LAMPUNG  126000  1997
8         KEP. RIAU  235000  1997
9       DKI JAKARTA  172500  1997

In [7]:
df.drop(df.columns[2], axis=1, inplace=True)

In [ ]:
# visualisasi pie chart
region = ('Aceh', 'Jawa Tengah', 'Riau', 'Jambi', 'Bali')


sorted_df = df.groupby("REGION").sum()
#df.groupby("REGION").sum().apply(list)

sorted_df["SALARY"]


#votes = (12, 11, 4, 8, 7)
#plt.pie(
#    sorted_df,
#)
#plt.show()